upload modified architecture flow
Signed-off-by: dbgalz11 <dbgalao@github.com>
